const state = {
  tabKey: 'randomKey',
  projects: {
    randomKey: {
      key: 'randomKey',
      title: 'test-chart',
      preview: false,
      chartData: {
        selectIndex: -1,
        activeIndex: -1,
        w: 1280,
        h: 800,
        elements: []
        // elements: [{"name":"新建图层2","w":400,"h":200,"bgcolor":"rgba(0, 0, 0, 0)","active":false,"data":{"type":"chart","settings":{"type":"pie"},"datacon":{"type":"raw","connectId":"","data":{"columns":["日期","访问用户"],"rows":[{"日期":"1月1日","访问用户":1523},{"日期":"1月2日","访问用户":1223},{"日期":"1月3日","访问用户":2123},{"日期":"1月4日","访问用户":4123},{"日期":"1月5日","访问用户":3123},{"日期":"1月6日","访问用户":7123}]},"getUrl":"","interval":2,"opacity":0},"generated":{"columns":["日期","访问用户"],"rows":[{"日期":"1月1日","访问用户":1523},{"日期":"1月2日","访问用户":1223},{"日期":"1月3日","访问用户":2123},{"日期":"1月4日","访问用户":4123},{"日期":"1月5日","访问用户":3123},{"日期":"1月6日","访问用户":7123}]}},"key":1589351735796,"x":880,"y":255},{"name":"新建图层1","w":759,"h":651,"bgcolor":"rgba(0, 0, 0, 0)","active":false,"data":{"type":"chart","settings":{"type":"line"},"datacon":{"type":"raw","connectId":"","data":{"columns":["日期","访问用户"],"rows":[{"日期":"1月1日","访问用户":1523},{"日期":"1月2日","访问用户":1223},{"日期":"1月3日","访问用户":2123},{"日期":"1月4日","访问用户":4123},{"日期":"1月5日","访问用户":3123},{"日期":"1月6日","访问用户":7123}]},"getUrl":"","interval":2,"opacity":0},"generated":{"columns":["日期","访问用户"],"rows":[{"日期":"1月1日","访问用户":1523},{"日期":"1月2日","访问用户":1223},{"日期":"1月3日","访问用户":2123},{"日期":"1月4日","访问用户":4123},{"日期":"1月5日","访问用户":3123},{"日期":"1月6日","访问用户":7123}]}},"key":1589351732887,"x":108,"y":149}],
      }
    }
  }
}

export default state
